{
  "personal": {
    "name": "Utkarsh Garg",
    "title": "Tech Lead & Full-Stack Developer",
    "email": "utkarsh22garg@gmail.com",
    "phone": "+91 – 7753839036",
    "location": "Hyderabad, India",
    "summary": "Full-Stack developer with 5+ years of professional experience, specializing in TypeScript, ReactJS, and NodeJS. Core contributor to business intelligence tools and logging micro-services, achieving significant performance improvements and scalability. Proven track record in mentoring, component library development, and data visualization. Recognized for significant performance improvements and effective data visualization solutions.",
    "social": {
      "linkedin": "https://linkedin.com/in/utkarsh22garg",
      "medium": "https://medium.com/@utkarsh22garg",
      "github": "https://github.com/utkarsh22garg"
    }
  },
  "education": {
    "degree": "Bachelor of Technology, Computer Science & Engineering",
    "institution": "Motilal Nehru National Institute of Technology (NIT) Allahabad",
    "duration": "2016-2020",
    "cgpa": "9.16/10"
  },
  "experience": [
    {
      "position": "Tech Lead",
      "company": "D. E. Shaw & Co.",
      "location": "Hyderabad, India",
      "duration": "July 2020 – Current",
      "description": "Member of the Web Infrastructure team, contributing to scalable frontend and backend development. Focuses on enhancing business intelligence tools, improving UI component libraries, optimizing performance, and mentoring team members.",
      "achievements": [
        "Developed and maintained a comprehensive business intelligence tool using TypeScript, ReactJS, and Storybook",
        "Implemented a robust Logger micro-service API with NodeJS, optimizing endpoints for large batched requests and effective data retrieval",
        "Created a usage logging insights tool in JavaScript and Python, aiding in data-driven decision making",
        "Increased data processing efficiency by 12x by integrating Dask for parallel-distributed computing in backend analytics",
        "Led the redevelopment of the React UI component library on Material UI and improved component development methodology",
        "Owned and maintained five projects to keep them updated and made sure developers use these modules without any hassle",
        "Actively participated in talent acquisition, interviewing candidates at IITs and contributing to the off-campus recruitment program"
      ]
    },
    {
      "position": "Placement Coordinator",
      "company": "NIT Allahabad",
      "location": "Prayagraj, India",
      "duration": "July 2019 – May 2020",
      "description": "Coordinated placement activities and student preparation programs.",
      "achievements": [
        "Conducted Mock tests and interviews to prepare students for college placements and internships",
        "Organized various training sessions and PPT's of several firms for crowd of 300-400 students",
        "Handled various logistics with the help of my team and made sure recruitment session by a company are organized successfully from start to end"
      ]
    },
    {
      "position": "Summer Intern",
      "company": "Visa Inc.",
      "location": "Bangalore, India",
      "duration": "May 2019 – July 2019",
      "description": "Contributed to the development and maintenance of a status tracker using ReactJS and Redux.",
      "achievements": [
        "Improved SDLC process by creating a status tracker, replacing the outdated email tracking method",
        "Created GoLang endpoints to fetch and update tracker configuration and data"
      ]
    }
  ],
  "projects": [
    {
      "name": "Chat Encrypter",
      "date": "Oct 2018",
      "technologies": [
        "Java",
        "Cryptography",
        "Socket Programming"
      ],
      "description": "Chat Application with end-to-end symmetric encryption with file transfer facility",
      "github": "https://github.com/utkarsh22garg/ChatEncrypter",
      "features": [
        "End-to-end encryption for secure messaging",
        "File transfer capability",
        "Real-time communication using socket programming"
      ]
    }
  ],
  "skills": {
    "languages": [
      "JavaScript",
      "TypeScript",
      "Python",
      "C",
      "C++",
      "Java",
      "HTML",
      "CSS",
      "SQL"
    ],
    "libraries": [
      "NodeJS",
      "ReactJS",
      "Redux",
      "react-query",
      "Material-UI",
      "Python-Dask",
      "React Testing Library",
      "Mocha",
      "Storybook"
    ],
    "tools": [
      "JupyterLab",
      "Visual Studio Code",
      "Linux",
      "Git"
    ]
  },
  "publications": [
    {
      "name": "Prediction of Emotions from the Audio Speech Signals using MFCC, MEL and Chroma",
      "journal": "IEEE",
      "date": "Nov 3, 2020",
      "description": "Emotion recognition from audio signals is a recent research topic in Human-Computer Interaction. A speech emotion recognition (SER) system is developed to detect emotion from the audio speech signals. SER is created by extracting various audio features and combining them differently to create feature vectors. The efficiency of emotion recognition system depends on type of features extracted and classifier used for detection of emotions. The feature vector contains important audio features like MFCC, MEL, and Chroma. Feature vectors are created using two combination of features. Several machine learning paradigms were used for the emotion classification task. Their performances are compared using confusion metrics. The model compares the performances on change in feature vector. The proposed model searches for the best classification algorithm, which has considerable improvement in emotion prediction.",
      "link": "https://ieeexplore.ieee.org/document/9242635"
    }
  ],
  "awards": [
    {
      "title": "Senior Technical Member Promotion",
      "description": "Promoted to Senior member Technical in 1.5 years for being a star performer in D.E. Shaw",
      "date": "2022"
    },
    {
      "title": "Merit Scholarship",
      "description": "Awarded Merit Scholarship award for standing in top 18 out of 176 students in academics during the college",
      "date": "2018"
    },
    {
      "title": "Global Coding Challenge",
      "description": "Secured global rank 317 out of 10000+ participants in January long challenge 2019 conducted by CodeChef",
      "date": "2019"
    },
    {
      "title": "Android Development Event",
      "description": "Secured a position in top 5 out of 31 teams in annual android event DROISRUSH conducted by MNNIT Allahabad",
      "date": "2018"
    }
  ]
}